# -*- coding: UTF-8 -*-
# author: chenyongjun

'''
    Python3 简介
        1、Python简介
            Python是一个高层次的结合了解释性、编译性、互动性和面向对象的脚本语言。
            Python的设计具有很强的可读性，相比其他语言经常使用英文关键字，其他语言的一些标点符号，它具有比其他语言更有特色语法结构。
            1）Python是一种解释型语言： 这意味着开发过程中没有了编译这个环节。类似于PHP和Perl语言。
            2）Python是交互式语言： 这意味着，您可以在一个Python提示符>>>后直接执行代码。
            3）Python是面向对象语言: 这意味着Python支持面向对象的风格或代码封装在对象的编程技术。
            4）Python是初学者的语言：Python对初级程序员而言，是一种伟大的语言，它支持广泛的应用程序开发，从简单的文字处理到WWW浏览器再到游戏。
        2、Python发展历史
        3、Python特点
            1）易于学习：Python有相对较少的关键字，结构简单，和一个明确定义的语法，学习起来更加简单。
            2）易于阅读：Python代码定义的更清晰。
            3）易于维护：Python的成功在于它的源代码是相当容易维护的。
            4）一个广泛的标准库：Python的最大的优势之一是丰富的库，跨平台的，在UNIX，Windows和Macintosh兼容很好。
            5）互动模式：互动模式的支持，您可以从终端输入执行代码并获得结果的语言，互动的测试和调试代码片断。
            6）可移植：基于其开放源代码的特性，Python已经被移植（也就是使其工作）到许多平台。
            7）可扩展：如果你需要一段运行很快的关键代码，或者是想要编写一些不愿开放的算法，你可以使用C或C++完成那部分程序，然后从你的Python程序中调用。
            8）数据库：Python提供所有主要的商业数据库的接口。
            9）GUI编程：Python支持GUI可以创建和移植到许多系统调用。
            10）可嵌入：你可以将Python嵌入到C/C++程序，让你的程序的用户获得"脚本化"的能力。
        4、Python应用
            1）云计算：云计算最热的语言，典型的应用OpenStack
            2）web开发：许多优秀的WEB框架，许多大型网站是Python开发、YouTube、Dropbox、Douban……典型的Web框架包括Django
            3）科学计算和人工智能：典型的图书馆NumPy、SciPy、Matplotlib、Enided图书馆、熊猫
            4）系统操作和维护：操作和维护人员的基本语言
            5）金融：定量交易、金融分析，在金融工程领域，Python不仅使用最多，而且使用最多，其重要性逐年增加。
            6）图形GUI：PyQT，WXPython，TkInter
'''
if __name__ == "__main__":
    print("Hello, World!")
