# -*- coding: UTF-8 -*-
# author: chen_yong_jun

"""
1.Python3 运算符: 算术运算符 、比较（关系）运算符、赋值运算符、逻辑运算符、位运算符、成员运算符、身份运算符
2.运算符优先级
"""

# Python算术运算符
a = 21
b = 10
c = 0

# 加 - 两个对象相加
d = a + b
print("加 - d 的值为：", d)
# 减 - 得到负数或是一个数减去另一个数
d = a - b
print("减 - d 的值为：", d)
# 乘 - 两个数相乘或是返回一个被重复若干次的字符串
d = a * b
print("乘 - d 的值为：", d)
# 除 - x 除以 y
d = a / b
print("除 - d 的值为：", d)
# 	取模 - 返回除法的余数
d = a % b
print("模 - d 的值为：", d)

# 修改变量 a 、b 、c
a = 2
b = 3
d = a ** b  # 幂 - 返回x的y次幂
print("幂 - d 的值为：", d)

a = 11
b = 5
d = a // b  # 取整除 - 返回商的整数部分
print("整 - d 的值为：", d)

